from string import Template

start = Template("Привіт, $name! 👋 \nЯ бот для курсу МЕТАСИСТЕМА і мене звуть МЕТА-ГРА, приємно познайомитися ☺️\n\nНавіщо я потрібен?\nДенис вигадав захоплюючу гру в якій учасники отримують бали за виконані завдання. За кожне завдання тобі надається різна кількість балів.\n\nЯкі завдання?\nЗавдання різні: ведення сторіс, розсилка, закриття клієнта та проведення консультації.\n\nТикай /info щоб отримати більше інформації про бота!")

profile = Template("👤 $name\n$team_name\n\n🎖 Кількість балів: $score\n\n💸 Клієнтів: $clients_count\n🥸 Консультацій: $consults_count")

confrontation_text = Template("🧢 Аватари $score_blue:$score_red Криптопанки 🔴\n\nУ синіх: $client_blue - клієнтів і $consult_blue - консультації\nУ червоних: $client_red - клієнтів і $consult_red - консультації\n\nОстання подія: $last_operation")

last_operation_storie = Template("")


info = '''*Дії, за які ти отримуєш бали*

СТОРІС
Якщо ти виставив історію в інстаграм, то напиши "сторіс" і далі виконуй все, що тебе попросить бот (потрібно відправити фото підтвердження / скрін історії)

РОЗСИЛКА
Якщо ти зробив розсилку, напиши «розсилка» і введи, скільки ти зробив розсилок за сьогодні. Мінімальна кількість — 10 шт)

КЛІЄНТ
Якщо ти закрив клієнта, напиши «клієнт», далі бот попросить вказати посилання на клієнта та чек.

КОНСУЛЬТАЦІЯ
Якщо ти провів консультацію, напиши слово "консультація" та пиши те, що попросить бот.


БАЛЬНА СИСТЕМА:

🔹 За 1 сторіс ти отримуєш 1 бал

🔹 За кожні 10 розсилок, бот дає 3 бали

🔹 За клієнта ти отримуєш бали залежно від чека:
від 1 до 99$ 20 балів
від 100 до 199$ 30 балів
від 200 до 299$ 40 балів
від 300$ 50 балів

*❗️УВАГА!* ЗА 0$ БОТ НЕ ДАЄ БАЛИ, так що не беріть клієнтів за 0$. Якщо це тестовий період, тоді тільки після нього відправляйте результат боту.

🔹 За консультацію:
За 0$ 5 балів
від 1 до 29$ 10 балів
від 30 до 59$ 15 балів
від 60 до 100$ 20 балів
від 101$ 30 балів

Також ти можеш переглянути свій профіль командою /profile. Там ти побачиш свій рейтинг, скільки клієнтів закрив за період і консультацій провів, в якій ти команді.

За допомогою команди /confrontation ти зможеш подивитися інформацію про свою команду та про команду противників, а використовуючи команду /intelligence зможеш побачити повну інформацію про свою команду.

Якщо щось не працює або десь є помилка, напиши /help і дотримуйся інструкції бота. За потреби ми зв'яжемося з тобою.

Це була вся інформація, гарної гри!'''